1c/src/Documents/ОформлениеАбонемента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОформлениеАбонемента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиАбонементов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/Documents/ЗаписьНаЗанятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаписьНаЗанятие</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗаписиНаЗанятия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Посещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПосещенияКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАбонементов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/Catalogs/АбонементыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АбонементыКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заморожен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/src/Catalogs/ВидыАбонементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыАбонементов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокДействияВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/src/HTTPServices/FitnessMobile/Ext/Module.bsl
#Область ОбработчикиСобытий

Функция HealthGETЗапрос(Запрос)

	Возврат JSONОтвет(200, Новый Структура("status, service", "ok", "fitness"));

КонецФункции

Функция ClientsGETЗапрос(Запрос)

	Возврат JSONОтвет(200, Новый Структура("items", СписокКлиентов()));

КонецФункции

Функция ClassesGETЗапрос(Запрос)

	Возврат JSONОтвет(200, Новый Структура("items", СписокЗанятий()));

КонецФункции

Функция MembershipTypesGETЗапрос(Запрос)

	Возврат JSONОтвет(200, Новый Структура("items", СписокВидовАбонементов()));

КонецФункции

Функция MembershipsGETЗапрос(Запрос)

	Возврат JSONОтвет(200, Новый Структура("items", СписокАбонементовКлиентов()));

КонецФункции

Функция MembershipsPOSTЗапрос(Запрос)

	Попытка
		Данные = ДанныеJSONИзЗапроса(Запрос);
		Клиент = СсылкаСправочникаКлиенты(ОбязательноеПоле(Данные, "clientRef"));
		ВидАбонемента = СсылкаСправочникаВидыАбонементов(ОбязательноеПоле(Данные, "membershipTypeRef"));

		КоличествоПосещений = ЧислоИлиЗначениеПоУмолчанию(ПолеИлиПустаяСтрока(Данные, "visitsCount"), ВидАбонемента.КоличествоПосещений);
		Сумма = ЧислоИлиЗначениеПоУмолчанию(ПолеИлиПустаяСтрока(Данные, "amount"), ВидАбонемента.Цена);
		ДатаНачала = ТекущаяДата();
		ДатаОкончания = ДатаНачала + ВидАбонемента.СрокДействияВДнях * 24 * 60 * 60;

		АбонементОбъект = Справочники.АбонементыКлиентов.СоздатьЭлемент();
		АбонементОбъект.Наименование = Строка(Клиент) + " - " + Строка(ВидАбонемента);
		АбонементОбъект.Клиент = Клиент;
		АбонементОбъект.ВидАбонемента = ВидАбонемента;
		АбонементОбъект.ДатаНачала = ДатаНачала;
		АбонементОбъект.ДатаОкончания = ДатаОкончания;
		АбонементОбъект.ОстатокПосещений = КоличествоПосещений;
		АбонементОбъект.Активен = Истина;
		АбонементОбъект.Записать();

		Документ = Документы.ОформлениеАбонемента.СоздатьДокумент();
		Документ.Дата = ТекущаяДата();
		Документ.Клиент = Клиент;
		Документ.ВидАбонемента = ВидАбонемента;
		Документ.АбонементКлиента = АбонементОбъект.Ссылка;
		Документ.ДатаНачала = ДатаНачала;
		Документ.ДатаОкончания = ДатаОкончания;
		Документ.КоличествоПосещений = КоличествоПосещений;
		Документ.Сумма = Сумма;
		Документ.Комментарий = ПолеИлиПустаяСтрока(Данные, "comment");
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат JSONОтветОшибки(400, ОписаниеОшибки());
	КонецПопытки;

	Возврат JSONОтвет(201, Новый Структура("membershipRef, documentRef, documentNumber", Строка(АбонементОбъект.Ссылка.УникальныйИдентификатор()), Строка(Документ.Ссылка.УникальныйИдентификатор()), Документ.Номер));

КонецФункции

Функция BookingsPOSTЗапрос(Запрос)

	Попытка
		Данные = ДанныеJSONИзЗапроса(Запрос);
		Документ = Документы.ЗаписьНаЗанятие.СоздатьДокумент();
		Документ.Дата = ТекущаяДата();
		Документ.Клиент = СсылкаСправочникаКлиенты(ОбязательноеПоле(Данные, "clientRef"));
		Документ.Занятие = СсылкаСправочникаЗанятия(ОбязательноеПоле(Данные, "classRef"));
		Документ.АбонементКлиента = СсылкаСправочникаАбонементыКлиентов(ПолеИлиПустаяСтрока(Данные, "membershipRef"));
		Документ.Отменена = Ложь;
		Документ.Комментарий = ПолеИлиПустаяСтрока(Данные, "comment");
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат JSONОтветОшибки(400, ОписаниеОшибки());
	КонецПопытки;

	Возврат JSONОтвет(201, ОтветДокумента(Документ.Ссылка));

КонецФункции

Функция VisitsPOSTЗапрос(Запрос)

	Попытка
		Данные = ДанныеJSONИзЗапроса(Запрос);
		Документ = Документы.Посещение.СоздатьДокумент();
		Документ.Дата = ТекущаяДата();
		Документ.Клиент = СсылкаСправочникаКлиенты(ОбязательноеПоле(Данные, "clientRef"));
		Документ.Занятие = СсылкаСправочникаЗанятия(ОбязательноеПоле(Данные, "classRef"));
		Документ.АбонементКлиента = СсылкаСправочникаАбонементыКлиентов(ПолеИлиПустаяСтрока(Данные, "membershipRef"));
		Документ.ВремяПосещения = ТекущаяДата();
		Документ.Комментарий = ПолеИлиПустаяСтрока(Данные, "comment");
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат JSONОтветОшибки(400, ОписаниеОшибки());
	КонецПопытки;

	Возврат JSONОтвет(201, ОтветДокумента(Документ.Ссылка));

КонецФункции

Функция ODataMetadataGETЗапрос(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/xml; charset=UTF-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаODataMetadata(), КодировкаТекста.UTF8);
	Возврат Ответ;

КонецФункции

Функция ODataClientsGETЗапрос(Запрос)

	Данные = Новый Структура;
	Данные.Вставить("@odata.context", "../odata/$metadata#clients");
	Данные.Вставить("value", СписокКлиентов());

	Возврат JSONОтвет(200, Данные);

КонецФункции

Функция ODataClassesGETЗапрос(Запрос)

	Данные = Новый Структура;
	Данные.Вставить("@odata.context", "../odata/$metadata#classes");
	Данные.Вставить("value", СписокЗанятий());

	Возврат JSONОтвет(200, Данные);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция JSONОтвет(КодСостояния, Данные)

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Данные), КодировкаТекста.UTF8);
	Возврат Ответ;

КонецФункции

Функция JSONОтветОшибки(КодСостояния, ТекстОшибки)

	Возврат JSONОтвет(КодСостояния, Новый Структура("error", ТекстОшибки));

КонецФункции

Функция СтрокаJSON(Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция СтрокаODataMetadata()

	Возврат "<?xml version=""1.0"" encoding=""UTF-8""?>"
		+ "<edmx:Edmx Version=""4.0"" xmlns:edmx=""http://docs.oasis-open.org/odata/ns/edmx"">"
		+ "<edmx:DataServices>"
		+ "<Schema Namespace=""FitnessMobile"" xmlns=""http://docs.oasis-open.org/odata/ns/edm"">"
		+ "<EntityType Name=""Client"">"
		+ "<Key><PropertyRef Name=""ref""/></Key>"
		+ "<Property Name=""ref"" Type=""Edm.String"" Nullable=""false""/>"
		+ "<Property Name=""name"" Type=""Edm.String""/>"
		+ "</EntityType>"
		+ "<EntityType Name=""Class"">"
		+ "<Key><PropertyRef Name=""ref""/></Key>"
		+ "<Property Name=""ref"" Type=""Edm.String"" Nullable=""false""/>"
		+ "<Property Name=""name"" Type=""Edm.String""/>"
		+ "</EntityType>"
		+ "<EntityContainer Name=""Container"">"
		+ "<EntitySet Name=""clients"" EntityType=""FitnessMobile.Client""/>"
		+ "<EntitySet Name=""classes"" EntityType=""FitnessMobile.Class""/>"
		+ "</EntityContainer>"
		+ "</Schema>"
		+ "</edmx:DataServices>"
		+ "</edmx:Edmx>";

КонецФункции

Функция ДанныеJSONИзЗапроса(Запрос)

	Тело = Запрос.ПолучитьТелоКакСтроку();
	Если ПустаяСтрока(Тело) Тогда
		ВызватьИсключение "Тело запроса пустое";
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();

	Возврат Данные;

КонецФункции

Функция ОбязательноеПоле(Данные, ИмяПоля)

	ЗначениеПоля = Неопределено;
	Если Не Данные.Свойство(ИмяПоля, ЗначениеПоля) Или ПустаяСтрока(ЗначениеПоля) Тогда
		ВызватьИсключение "Не заполнено поле " + ИмяПоля;
	КонецЕсли;

	Возврат ЗначениеПоля;

КонецФункции

Функция ПолеИлиПустаяСтрока(Данные, ИмяПоля)

	ЗначениеПоля = "";
	Данные.Свойство(ИмяПоля, ЗначениеПоля);
	Возврат ЗначениеПоля;

КонецФункции

Функция СсылкаСправочникаКлиенты(Идентификатор)

	Возврат СсылкаПоУникальномуИдентификатору(Справочники.Клиенты, Идентификатор);

КонецФункции

Функция СсылкаСправочникаЗанятия(Идентификатор)

	Возврат СсылкаПоУникальномуИдентификатору(Справочники.Занятия, Идентификатор);

КонецФункции

Функция СсылкаСправочникаВидыАбонементов(Идентификатор)

	Возврат СсылкаПоУникальномуИдентификатору(Справочники.ВидыАбонементов, Идентификатор);

КонецФункции

Функция СсылкаСправочникаАбонементыКлиентов(Идентификатор)

	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Справочники.АбонементыКлиентов.ПустаяСсылка();
	КонецЕсли;

	Возврат СсылкаПоУникальномуИдентификатору(Справочники.АбонементыКлиентов, Идентификатор);

КонецФункции

Функция СсылкаПоУникальномуИдентификатору(МенеджерСправочника, Идентификатор)

	Попытка
		Ссылка = МенеджерСправочника.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	Исключение
		ВызватьИсключение "Некорректная ссылка: " + Идентификатор;
	КонецПопытки;

	Возврат Ссылка;

КонецФункции

Функция ОтветДокумента(СсылкаДокумента)

	Возврат Новый Структура("ref, number", Строка(СсылкаДокумента.УникальныйИдентификатор()), СсылкаДокумента.Номер);

КонецФункции

Функция ЧислоИлиЗначениеПоУмолчанию(Значение, ЗначениеПоУмолчанию)

	Если ПустаяСтрока(Значение) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Возврат Число(Значение);

КонецФункции

Функция СписокВидовАбонементов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| ВидыАбонементов.Ссылка КАК Ссылка,
	| ВидыАбонементов.Наименование КАК Наименование,
	| ВидыАбонементов.КоличествоПосещений КАК КоличествоПосещений,
	| ВидыАбонементов.СрокДействияВДнях КАК СрокДействияВДнях,
	| ВидыАбонементов.Цена КАК Цена
	|ИЗ
	| Справочник.ВидыАбонементов КАК ВидыАбонементов
	|ГДЕ
	| НЕ ВидыАбонементов.ПометкаУдаления";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("ref, name, visitsCount, validityDays, price", Строка(Выборка.Ссылка.УникальныйИдентификатор()), Выборка.Наименование, Выборка.КоличествоПосещений, Выборка.СрокДействияВДнях, Выборка.Цена));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СписокАбонементовКлиентов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| АбонементыКлиентов.Ссылка КАК Ссылка,
	| АбонементыКлиентов.Наименование КАК Наименование,
	| АбонементыКлиентов.Клиент КАК Клиент,
	| АбонементыКлиентов.ВидАбонемента КАК ВидАбонемента,
	| АбонементыКлиентов.ДатаНачала КАК ДатаНачала,
	| АбонементыКлиентов.ДатаОкончания КАК ДатаОкончания,
	| АбонементыКлиентов.Активен КАК Активен
	|ИЗ
	| Справочник.АбонементыКлиентов КАК АбонементыКлиентов
	|ГДЕ
	| НЕ АбонементыКлиентов.ПометкаУдаления";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("ref, name, clientRef, membershipTypeRef, dateStart, dateEnd, active", Строка(Выборка.Ссылка.УникальныйИдентификатор()), Выборка.Наименование, Строка(Выборка.Клиент.УникальныйИдентификатор()), Строка(Выборка.ВидАбонемента.УникальныйИдентификатор()), Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.Активен));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СписокКлиентов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| Клиенты.Ссылка КАК Ссылка,
	| Клиенты.Наименование КАК Наименование
	|ИЗ
	| Справочник.Клиенты КАК Клиенты
	|ГДЕ
	| НЕ Клиенты.ПометкаУдаления";

	Возврат МассивИзВыборки(Запрос.Выполнить().Выбрать());

КонецФункции

Функция СписокЗанятий()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| Занятия.Ссылка КАК Ссылка,
	| Занятия.Наименование КАК Наименование
	|ИЗ
	| Справочник.Занятия КАК Занятия
	|ГДЕ
	| НЕ Занятия.ПометкаУдаления";

	Возврат МассивИзВыборки(Запрос.Выполнить().Выбрать());

КонецФункции

Функция МассивИзВыборки(Выборка)

	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("ref, name", Строка(Выборка.Ссылка.УникальныйИдентификатор()), Выборка.Наименование));
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
